NetologySlow/src/Documents/НачислениеПоОкладу/НачислениеПоОкладу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НачислениеПоОкладу</name>
  <registerRecords>CalculationRegister.Зарплата</registerRecords>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.НачисленияУдержания</types>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаОклада</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоРабочихДней</name>
      <type>
        <types>DefinedType.Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаОдногоДня</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

NetologySlow/src/Documents/НачислениеПоОкладу/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ПриИзмененииСотрудника(ИзмененнаяСтрока)   
	
	Если ЗначениеЗаполнено(ИзмененнаяСтрока.Сотрудник) Тогда
	   Сотрудник = ИзмененнаяСтрока.Сотрудник; 
	   СуммаОклада = СотрудникиВызовСервера.СотрудникОклад(Сотрудник);
	   ИзмененнаяСтрока.СуммаОклада = СуммаОклада;   
	   ИзмененнаяСтрока.ДатаНачала = НачалоМесяца(Объект.Дата);
	   ИзмененнаяСтрока.ДатаОкончания = КонецМесяца(Объект.Дата);      
	   ИзмененнаяСтрока.КоличествоРабочихДней = ПодсчетыРабДнейСервер.ЧислоРабДней(ИзмененнаяСтрока.ДатаНачала, ИзмененнаяСтрока.ДатаОкончания); 
	   ИзмененнаяСтрока.СтавкаОдногоДня = СуммаОклада /  ИзмененнаяСтрока.КоличествоРабочихДней; 
    КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиСотрудникПриИзменении(Элемент)  
	ИзмененнаяСтрока=Элементы.Сотрудники.ТекущиеДанные;
	ПриИзмененииСотрудника(ИзмененнаяСтрока);
КонецПроцедуры
